---
kind: property
id: P:Autodesk.Revit.UI.RibbonPanel.Name
zh: 功能区
source: html/9a65f728-409b-a1f9-d803-3aabacb7f51a.htm
---
# Autodesk.Revit.UI.RibbonPanel.Name Property

**中文**: 功能区

Gets or sets the name of the RibbonPanel.

## Syntax (C#)
```csharp
public string Name { get; set; }
```

## Remarks
The name will be displayed on the panel if the Text is not set.